app/views/posts/_post.html.erb

                  <div class="panel-body"><!-- Panel Body -->
                    <div style="color: #3BB2D6;"><%= time_ago_in_words(post.created_at) %></div>
---
INSERT INTO "posts" ("title", "context", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First"], ["context", "aaajam acacjsajc"], ["created_at", 2016-11-26 15:02:37 UTC], ["updated_at", 2016-11-26 15:02:37 UTC]]