app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "context", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First"], ["context", "akajdjad aadak cakcjakc"], ["created_at", 2016-11-26 14:20:23 UTC], ["updated_at", 2016-11-26 14:20:23 UTC]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "context" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["context", "sjjfjsc "], ["updated_at", 2016-11-26 16:05:04 UTC], ["id", 5]]